const modeTypeList = [{ title: "官方", val: "0" }, { title: "传统", val: "1" }];

const lhcCodeColor = {
  red: [
    "01",
    "02",
    "07",
    "08",
    "12",
    "13",
    "18",
    "19",
    "23",
    "24",
    "29",
    "30",
    "34",
    "35",
    "40",
    "45",
    "46"
  ],
  blue: [
    "03",
    "04",
    "09",
    "10",
    "14",
    "15",
    "20",
    "25",
    "26",
    "31",
    "36",
    "37",
    "41",
    "42",
    "47",
    "48"
  ],
  green: [
    "05",
    "06",
    "11",
    "16",
    "17",
    "21",
    "22",
    "27",
    "28",
    "32",
    "33",
    "38",
    "39",
    "43",
    "44",
    "49"
  ]
};

const assistantList = [
  { icon: "&#xe612;", text: "投注记录", urlName: "betrecord" },
  { icon: "&#xe61b;", text: "走势图", urlName: "gametrend" },
  { icon: "&#xe61c;", text: "玩法说明", urlName: "gamedescription" },
  { icon: "&#xe6c8;", text: "长龙助手", urlName: "changlong" }
];

const operatorList = {
  all: "全",
  large: "大",
  small: "小",
  odd: "单",
  even: "双",
  none: "清"
};

const codeAndTitle = {
  1: {
    // 时时彩
    titleArr: ["万位", "千位", "百位", "十位", "个位"],
    codeArr: ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"]
  },
  2: {
    // 11选5
    titleArr: ["万位", "千位", "百位", "十位", "个位"],
    codeArr: ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11"]
  },
  3: {
    // 福彩3d
    titleArr: ["百位", "十位", "个位"],
    codeArr: ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"]
  },
  4: {
    // 快乐10分
    titleArr: [
      "第一位",
      "第二位",
      "第三位",
      "第四位",
      "第五位",
      "第六位",
      "第七位",
      "第八位"
    ],
    codeArr: [
      "01",
      "02",
      "03",
      "04",
      "05",
      "06",
      "07",
      "08",
      "09",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20"
    ]
  },
  5: {
    // 分分彩
    titleArr: ["万位", "千位", "百位", "十位", "个位"],
    codeArr: ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"]
  },
  6: {
    // pk10
    titleArr: [
      "冠军",
      "亚军",
      "季军",
      "第四名",
      "第五名",
      "第六名",
      "第七名",
      "第八名",
      "第九名",
      "第十名"
    ],
    codeArr: ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10"],
    codeColor: [
      "#B0DD1D",
      "#6ADD1D",
      "#1DDD53",
      "#1DDDB7",
      "#1DBDDD",
      "#1D73DD",
      "#B01DDD",
      "#DD1DC0",
      "#DD1D6D",
      "#DD7A1D"
    ]
  },
  8: {
    // 快乐8
    titleArr: ["万位", "千位", "百位", "十位", "个位"],
    codeArr: ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"]
  },
  9: {
    // 快3
    titleArr: ["百位", "十位", "个位"],
    codeArr: ["1", "2", "3", "4", "5", "6"]
  },
  10: {
    // 幸运28
    titleArr: ["百位", "十位", "个位"],
    codeArr: ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"]
  },
  11: {
    // 六合彩
    titleArr: [],
    codeArr: [
      "正码一",
      "正码二",
      "正码三",
      "正码四",
      "正码五",
      "正码六",
      "特码"
    ]
  },
  12: {
    // 幸运飞艇
    titleArr: [
      "冠军",
      "亚军",
      "季军",
      "第四名",
      "第五名",
      "第六名",
      "第七名",
      "第八名",
      "第九名",
      "第十名"
    ],
    codeArr: ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10"],
    codeColor: [
      "#B0DD1D",
      "#6ADD1D",
      "#1DDD53",
      "#1DDDB7",
      "#1DBDDD",
      "#1D73DD",
      "#B01DDD",
      "#DD1DC0",
      "#DD1D6D",
      "#DD7A1D"
    ]
  }
};

export {
  lhcCodeColor,
  assistantList,
  modeTypeList,
  operatorList,
  codeAndTitle
};
